src/main/resources/example-soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetUserRequest xmlns="http://example.com/user">
            <UserId>12345</UserId>
        </GetUserRequest>
    </soap:Body>
</soap:Envelope>